In [1]:
import pandas as pd

In [2]:
train_df=pd.read_csv('train.csv')
train_df.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,2,"Weisz, Mrs. Leopold (Mathilde Francoise Pede)",female,29.0,1,0,228414,26.000,NaN,S,1
1,3,"Williams, Mr. Howard Hugh ""Harry""",male,NaN,0,0,A/5 2466,8.050,NaN,S,0
2,2,"Morley, Mr. Henry Samuel (""Mr Henry Marshall"")",male,39.0,0,0,250655,26.000,NaN,S,0
3,3,"Palsson, Mrs. Nils (Alma Cornelia Berglund)",female,29.0,0,4,349909,21.075,NaN,S,0
4,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.050,NaN,S,0

In [4]:
train_df['SibSp'].unique()

array([1, 0, 2, 8, 4, 3, 5], dtype=int64)

In [5]:
train_df['Parch'].unique()

array([0, 4, 1, 2, 5, 3, 6], dtype=int64)

In [10]:
train_df['Pclass'].unique()

array([2, 3, 1], dtype=int64)

In [11]:
train_df.isna().sum()

Pclass        0
Name          0
Sex           0
Age         132
SibSp         0
Parch         0
Ticket        0
Fare          0
Cabin       514
Embarked      1
Survived      0
dtype: int64

In [12]:
train_df.drop(['Name','Ticket','Cabin'],axis=1,inplace=True)

In [13]:
train_df.head()

   Pclass     Sex   Age  SibSp  Parch    Fare Embarked  Survived
0       2  female  29.0      1      0  26.000        S         1
1       3    male   NaN      0      0   8.050        S         0
2       2    male  39.0      0      0  26.000        S         0
3       3  female  29.0      0      4  21.075        S         0
4       3    male  25.0      0      0   7.050        S         0

In [17]:
train_df['Embarked'].unique()

array(['S', 'C', 'Q'], dtype=object)

In [16]:
train_df['Embarked'].fillna('S',inplace=True)

In [22]:
dummies_age=pd.get_dummies(train_df['Sex'],drop_first=True)
train_df=pd.concat([train_df,dummies_age],axis=1)

In [25]:
dummies_embarked=pd.get_dummies(train_df['Embarked'],drop_first=True)
train_df=pd.concat([train_df,dummies_embarked],axis=1)

In [26]:
train_df.drop(['Sex','Embarked'],axis=1,inplace=True)

In [27]:
train_df['Age'].fillna(train_df['Age'].mean(),inplace=True)

In [28]:
train_df.head()

   Pclass       Age  SibSp  Parch    Fare  Survived  male  Q  S
0       2  29.00000      1      0  26.000         1     0  0  1
1       3  29.70056      0      0   8.050         0     1  0  1
2       2  39.00000      0      0  26.000         0     1  0  1
3       3  29.00000      0      4  21.075         0     0  0  1
4       3  25.00000      0      0   7.050         0     1  0  1

In [29]:
train_df.isna().sum()

Pclass      0
Age         0
SibSp       0
Parch       0
Fare        0
Survived    0
male        0
Q           0
S           0
dtype: int64

In [33]:
x_train=train_df.drop('Survived',axis=1).values
x_train.shape

(668, 8)

In [35]:
y_train=train_df['Survived'].values
y_train.shape

(668,)

In [36]:
from sklearn.linear_model import LogisticRegression

In [37]:
clf=LogisticRegression(max_iter=1000)
clf.fit(x_train,y_train)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
                   intercept_scaling=1, l1_ratio=None, max_iter=1000,
                   multi_class='auto', n_jobs=None, penalty='l2',
                   random_state=None, solver='lbfgs', tol=0.0001, verbose=0,
                   warm_start=False)

In [38]:
clf.score(x_train,y_train)

0.7904191616766467

In [40]:
test_df=pd.read_csv('test.csv')
test_df.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,2,"Davies, Master. John Morgan Jr",male,8.0,1,1,C.A. 33112,36.7500,NaN,S
1,1,"Leader, Dr. Alice (Farnham)",female,49.0,0,0,17465,25.9292,D17,S
2,3,"Kilgannon, Mr. Thomas J",male,NaN,0,0,36865,7.7375,NaN,Q
3,2,"Jacobsohn, Mrs. Sidney Samuel (Amy Frances Chr...",female,24.0,2,1,243847,27.0000,NaN,S
4,1,"McGough, Mr. James Robert",male,36.0,0,0,PC 17473,26.2875,E25,S

In [41]:
test_df.drop(['Name','Ticket','Cabin'],axis=1,inplace=True)

In [42]:
test_df.isna().sum()

Pclass       0
Sex          0
Age         45
SibSp        0
Parch        0
Fare         0
Embarked     1
dtype: int64

In [43]:
test_df['Age'].fillna(test_df['Age'].mean(),inplace=True)

In [44]:
test_df['Embarked'].fillna('S',inplace=True)

In [45]:
dummies_age=pd.get_dummies(test_df['Sex'],drop_first=True)
test_df=pd.concat([test_df,dummies_age],axis=1)

In [46]:
dummies_embarked=pd.get_dummies(test_df['Embarked'],drop_first=True)
test_df=pd.concat([test_df,dummies_embarked],axis=1)

In [47]:
test_df.drop(['Sex','Embarked'],axis=1,inplace=True)

In [48]:
test_df.head()

   Pclass        Age  SibSp  Parch     Fare  male  Q  S
0       2   8.000000      1      1  36.7500     1  0  1
1       1  49.000000      0      0  25.9292     0  0  1
2       3  29.694775      0      0   7.7375     1  1  0
3       2  24.000000      2      1  27.0000     0  0  1
4       1  36.000000      0      0  26.2875     1  0  1

In [49]:
x_test=test_df.values
x_test.shape

(223, 8)